In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [47]:
import pandas as pd
from io import StringIO

data = """Order_ID,Customer_ID,Order_Date,Delivery_Date,Product_Category,Product_Price,Quantity,Discount,Payment_Method,Customer_Age,Customer_Gender,City,Return_Flag,Customer_Rating
1001,C001,2023-01-05,2023-01-08,Electronics,45000,1,10,Credit Card,28,M,Delhi,No,5
1002,C002,2023-01-06,2023-01-20,Clothing,2500,3,40,UPI,22,F,Mumbai,Yes,2
1003,C003,2023-02-10,2023-02-13,Home Decor,7000,1,15,Debit Card,35,F,Bangalore,No,4
1004,C001,2023-02-14,2023-02-28,Electronics,120000,1,5,Net Banking,28,M,Delhi,Yes,1
1005,C004,2023-03-01,2023-03-05,Beauty,1800,4,30,COD,19,F,Jaipur,No,4
1006,C005,2023-03-18,2023-03-30,Clothing,3200,2,50,UPI,42,M,Kolkata,Yes,2
1007,C006,2023-04-02,2023-04-04,Electronics,65000,1,20,Credit Card,31,F,Pune,No,5
1008,C007,2023-04-10,2023-04-25,Home Decor,15000,1,35,Debit Card,55,M,Chennai,Yes,3
1009,C008,2023-05-05,2023-05-06,Beauty,999,5,60,UPI,24,F,Delhi,No,4
1010,C009,2023-05-20,2023-06-10,Electronics,90000,1,25,COD,38,M,Patna,Yes,1
1011,C010,2023-06-01,2023-06-03,Clothing,4200,2,10,Credit Card,27,F,Bangalore,No,5
1012,C011,2023-06-15,2023-07-01,Home Decor,22000,1,45,Net Banking,48,F,Lucknow,Yes,2
1013,C012,2023-07-07,2023-07-09,Beauty,1500,6,20,UPI,21,F,Mumbai,No,5
1014,C013,2023-07-20,2023-08-05,Electronics,300000,1,30,Credit Card,60,M,Gurgaon,Yes,1
1015,C014,2023-08-01,2023-08-02,Clothing,2800,3,5,COD,33,M,Indore,No,4
1016,C015,2023-08-18,2023-09-10,Home Decor,18000,1,50,Debit Card,45,F,Noida,Yes,2
1017,C016,2023-09-05,2023-09-06,Beauty,1200,4,10,UPI,26,F,Delhi,No,5
1018,C017,2023-09-25,2023-10-15,Electronics,75000,1,35,Net Banking,39,M,Ranchi,Yes,1
1019,C018,2023-10-02,2023-10-03,Clothing,5200,2,15,Credit Card,29,F,Pune,No,4
1020,C019,2023-10-18,2023-11-02,Home Decor,26000,1,40,COD,52,M,Bhopal,Yes,3
"""

df = pd.read_csv(StringIO(data))

print(df.head())

   Order_ID Customer_ID  Order_Date Delivery_Date Product_Category  \
0      1001        C001  2023-01-05    2023-01-08      Electronics
1      1002        C002  2023-01-06    2023-01-20         Clothing
2      1003        C003  2023-02-10    2023-02-13       Home Decor
3      1004        C001  2023-02-14    2023-02-28      Electronics
4      1005        C004  2023-03-01    2023-03-05           Beauty

   Product_Price  Quantity  Discount Payment_Method  Customer_Age  \
0          45000         1        10    Credit Card            28
1           2500         3        40            UPI            22
2           7000         1        15     Debit Card            35
3         120000         1         5    Net Banking            28
4           1800         4        30            COD            19

  Customer_Gender       City Return_Flag  Customer_Rating
0               M      Delhi          No                5
1               F     Mumbai         Yes                2
2               F  Bangalore          No                4
3               M      Delhi         Yes                1
4               F     Jaipur          No                4

In [43]:
df = df.reset_index(drop=True)

In [48]:
df.head()

,Order_ID,Customer_ID,Order_Date,Delivery_Date,Product_Category,Product_Price,Quantity,Discount,Payment_Method,Customer_Age,Customer_Gender,City,Return_Flag,Customer_Rating
0,1001,C001,2023-01-05,2023-01-08,Electronics,45000,1,10,Credit Card,28,M,Delhi,No,5
1,1002,C002,2023-01-06,2023-01-20,Clothing,2500,3,40,UPI,22,F,Mumbai,Yes,2
2,1003,C003,2023-02-10,2023-02-13,Home Decor,7000,1,15,Debit Card,35,F,Bangalore,No,4
3,1004,C001,2023-02-14,2023-02-28,Electronics,120000,1,5,Net Banking,28,M,Delhi,Yes,1
4,1005,C004,2023-03-01,2023-03-05,Beauty,1800,4,30,COD,19,F,Jaipur,No,4

In [50]:
df['Product_Category'].value_counts()

Product_Category
Electronics    6
Clothing       5
Home Decor     5
Beauty         4
Name: count, dtype: int64

In [51]:
Electronics_df = df[df['Product_Category'] == 'Electronics']

In [52]:
Electronics_df

,Order_ID,Customer_ID,Order_Date,Delivery_Date,Product_Category,Product_Price,Quantity,Discount,Payment_Method,Customer_Age,Customer_Gender,City,Return_Flag,Customer_Rating
0,1001,C001,2023-01-05,2023-01-08,Electronics,45000,1,10,Credit Card,28,M,Delhi,No,5
3,1004,C001,2023-02-14,2023-02-28,Electronics,120000,1,5,Net Banking,28,M,Delhi,Yes,1
6,1007,C006,2023-04-02,2023-04-04,Electronics,65000,1,20,Credit Card,31,F,Pune,No,5
9,1010,C009,2023-05-20,2023-06-10,Electronics,90000,1,25,COD,38,M,Patna,Yes,1
13,1014,C013,2023-07-20,2023-08-05,Electronics,300000,1,30,Credit Card,60,M,Gurgaon,Yes,1
17,1018,C017,2023-09-25,2023-10-15,Electronics,75000,1,35,Net Banking,39,M,Ranchi,Yes,1

In [53]:

df.describe()

,Order_ID,Product_Price,Quantity,Discount,Customer_Age,Customer_Rating
count,20.00000,20.000000,20.000000,20.000000,20.000000,20.000000
mean,1010.50000,40319.950000,2.100000,27.500000,35.100000,3.150000
std,5.91608,70223.691699,1.552587,16.503588,11.915934,1.531253
min,1001.00000,999.000000,1.000000,5.000000,19.000000,1.000000
25%,1005.75000,2725.000000,1.000000,13.750000,26.750000,2.000000
50%,1010.50000,11000.000000,1.000000,27.500000,32.000000,3.500000
75%,1015.25000,50000.000000,3.000000,40.000000,42.750000,4.250000
max,1020.00000,300000.000000,6.000000,60.000000,60.000000,5.000000

In [58]:
df['Discount'].mean()

np.float64(27.5)

In [59]:
df['Product_Price'].sum()

np.int64(806399)

In [60]:
df['Return_Flag'].value_counts()

Return_Flag
No     10
Yes    10
Name: count, dtype: int64

In [64]:
df['Return_Flag'].value_counts()

Return_Flag
No     10
Yes    10
Name: count, dtype: int64

In [65]:
count_yes = df[df['Return_Flag'] == 'Yes']

In [70]:
count_yes

,Order_ID,Customer_ID,Order_Date,Delivery_Date,Product_Category,Product_Price,Quantity,Discount,Payment_Method,Customer_Age,Customer_Gender,City,Return_Flag,Customer_Rating
1,1002,C002,2023-01-06,2023-01-20,Clothing,2500,3,40,UPI,22,F,Mumbai,Yes,2
3,1004,C001,2023-02-14,2023-02-28,Electronics,120000,1,5,Net Banking,28,M,Delhi,Yes,1
5,1006,C005,2023-03-18,2023-03-30,Clothing,3200,2,50,UPI,42,M,Kolkata,Yes,2
7,1008,C007,2023-04-10,2023-04-25,Home Decor,15000,1,35,Debit Card,55,M,Chennai,Yes,3
9,1010,C009,2023-05-20,2023-06-10,Electronics,90000,1,25,COD,38,M,Patna,Yes,1
11,1012,C011,2023-06-15,2023-07-01,Home Decor,22000,1,45,Net Banking,48,F,Lucknow,Yes,2
13,1014,C013,2023-07-20,2023-08-05,Electronics,300000,1,30,Credit Card,60,M,Gurgaon,Yes,1
15,1016,C015,2023-08-18,2023-09-10,Home Decor,18000,1,50,Debit Card,45,F,Noida,Yes,2
17,1018,C017,2023-09-25,2023-10-15,Electronics,75000,1,35,Net Banking,39,M,Ranchi,Yes,1
19,1020,C019,2023-10-18,2023-11-02,Home Decor,26000,1,40,COD,52,M,Bhopal,Yes,3

In [71]:
count_yes.shape[0]

10

In [72]:
df['Order_ID'].shape[0]

20

In [74]:
return_rate =( count_yes.shape[0] / df['Order_ID'].shape[0]	) * 100
return_rate

50.0

In [75]:
df.head()

,Order_ID,Customer_ID,Order_Date,Delivery_Date,Product_Category,Product_Price,Quantity,Discount,Payment_Method,Customer_Age,Customer_Gender,City,Return_Flag,Customer_Rating
0,1001,C001,2023-01-05,2023-01-08,Electronics,45000,1,10,Credit Card,28,M,Delhi,No,5
1,1002,C002,2023-01-06,2023-01-20,Clothing,2500,3,40,UPI,22,F,Mumbai,Yes,2
2,1003,C003,2023-02-10,2023-02-13,Home Decor,7000,1,15,Debit Card,35,F,Bangalore,No,4
3,1004,C001,2023-02-14,2023-02-28,Electronics,120000,1,5,Net Banking,28,M,Delhi,Yes,1
4,1005,C004,2023-03-01,2023-03-05,Beauty,1800,4,30,COD,19,F,Jaipur,No,4

In [84]:
count_c = df['Customer_ID'].value_counts()
count_c

Customer_ID
C001    2
C011    1
C018    1
C017    1
C016    1
C015    1
C014    1
C013    1
C012    1
C010    1
C002    1
C009    1
C008    1
C007    1
C006    1
C005    1
C004    1
C003    1
C019    1
Name: count, dtype: int64

In [86]:
cc2 = count_c[count_c >= 2].index
cc2

Index(['C001'], dtype='object', name='Customer_ID')

In [89]:
df_filtered = df[df['Customer_ID'].isin(cc2)]
df_filtered

,Order_ID,Customer_ID,Order_Date,Delivery_Date,Product_Category,Product_Price,Quantity,Discount,Payment_Method,Customer_Age,Customer_Gender,City,Return_Flag,Customer_Rating
0,1001,C001,2023-01-05,2023-01-08,Electronics,45000,1,10,Credit Card,28,M,Delhi,No,5
3,1004,C001,2023-02-14,2023-02-28,Electronics,120000,1,5,Net Banking,28,M,Delhi,Yes,1

In [90]:
df['Discount'].mean()

np.float64(27.5)

Empty DataFrame
Columns: [Order_ID, Customer_ID, Order_Date, Delivery_Date, Product_Category, Product_Price, Quantity, Discount, Payment_Method, Customer_Age, Customer_Gender, City, Return_Flag, Customer_Rating]
Index: []

In [98]:
# 30% ya usse zyada discount wale rows
df_cd = df[df['Discount'] >= 8.25]

# Result
df_cd

,Order_ID,Customer_ID,Order_Date,Delivery_Date,Product_Category,Product_Price,Quantity,Discount,Payment_Method,Customer_Age,Customer_Gender,City,Return_Flag,Customer_Rating
0,1001,C001,2023-01-05,2023-01-08,Electronics,45000,1,10,Credit Card,28,M,Delhi,No,5
1,1002,C002,2023-01-06,2023-01-20,Clothing,2500,3,40,UPI,22,F,Mumbai,Yes,2
2,1003,C003,2023-02-10,2023-02-13,Home Decor,7000,1,15,Debit Card,35,F,Bangalore,No,4
4,1005,C004,2023-03-01,2023-03-05,Beauty,1800,4,30,COD,19,F,Jaipur,No,4
5,1006,C005,2023-03-18,2023-03-30,Clothing,3200,2,50,UPI,42,M,Kolkata,Yes,2
6,1007,C006,2023-04-02,2023-04-04,Electronics,65000,1,20,Credit Card,31,F,Pune,No,5
7,1008,C007,2023-04-10,2023-04-25,Home Decor,15000,1,35,Debit Card,55,M,Chennai,Yes,3
8,1009,C008,2023-05-05,2023-05-06,Beauty,999,5,60,UPI,24,F,Delhi,No,4
9,1010,C009,2023-05-20,2023-06-10,Electronics,90000,1,25,COD,38,M,Patna,Yes,1
10,1011,C010,2023-06-01,2023-06-03,Clothing,4200,2,10,Credit Card,27,F,Bangalore,No,5
11,1012,C011,2023-06-15,2023-07-01,Home Decor,22000,1,45,Net Banking,48,F,Lucknow,Yes,2
12,1013,C012,2023-07-07,2023-07-09,Beauty,1500,6,20,UPI,21,F,Mumbai,No,5
13,1014,C013,2023-07-20,2023-08-05,Electronics,300000,1,30,Credit Card,60,M,Gurgaon,Yes,1
15,1016,C015,2023-08-18,2023-09-10,Home Decor,18000,1,50,Debit Card,45,F,Noida,Yes,2
16,1017,C016,2023-09-05,2023-09-06,Beauty,1200,4,10,UPI,26,F,Delhi,No,5
17,1018,C017,2023-09-25,2023-10-15,Electronics,75000,1,35,Net Banking,39,M,Ranchi,Yes,1
18,1019,C018,2023-10-02,2023-10-03,Clothing,5200,2,15,Credit Card,29,F,Pune,No,4
19,1020,C019,2023-10-18,2023-11-02,Home Decor,26000,1,40,COD,52,M,Bhopal,Yes,3